#include <cs50.h>
#include <stdio.h>

int main(void)
{
    float cash;
    for (;;){
        cash = get_float("Введите сдачу\n");
        if (cash <= 0) {
            printf("Вы ввели неверное число\n");
            continue;
        }
        else {
        break;
        }
    break;
    }
    int c1000, c500, c100, c50, c10, c5, c1;
    c1000 = cash*100 / 1000;
    c500 = (cash*100 - c1000*1000) / 500;
    c100 = (cash*100 - c500*500 - c1000*1000) / 100;
    c50 = (cash*100 - c100*100 - c500*500 - c1000*1000) / 50;
    c10 = (cash*100 - c50*50 - c100*100 - c500*500 - c1000*1000) / 10;
    c5 = (cash*100 - c10*10 - c50*50 - c100*100 - c500*500 - c1000*1000) / 5;
    c1 = cash*100 - c5*5 - c10*10 - c50*50 - c100*100 - c500*500 - c1000*1000;
    printf("Сдача в монетах 10 рублей (шт): %i\n", c1000);
    printf("Сдача в монетах 5 рублей (шт): %i\n", c500);
    printf("Сдача в монетах 1 рубль (шт): %i\n", c100);
    printf("Сдача в монетах 50 копеек (шт): %i\n", c50);
    printf("Сдача в монетах 10 копеек (шт): %i\n", c10);
    printf("Сдача в монетах 5 копеек (шт): %i\n", c5);
    printf("Сдача в монетах 1 копеек (шт): %i\n", c1);
}